neovim/configs/plugins/03-cmp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>nvim-cmp Completion Configuration</title>
<meta name="generator" content="Org Mode" />
<meta name="viewport" content="width=device-width, initial-scale=1"><link rel="stylesheet" href="/assets/styles/toc-sidebar.css"></head>
<body>
<main id="content" class="prose prose-zinc dark:prose-invert mx-auto w-full max-w-xl md:max-w-xl lg:max-w-2xl xl:max-w-3xl px-4 sm:px-6 lg:px-8">
<h1 class="title">nvim-cmp Completion Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgc7603a3">1. Overview</a></li>
<li><a href="#orgd737b03">2. Setup</a></li>
<li><a href="#org0d3cc1d">3. Load Snippets</a></li>
<li><a href="#orgf4f5bed">4. Configuration Explained</a>
<ul>
<li><a href="#orgfb65247">4.1. Snippet Engine</a></li>
<li><a href="#orgd3f00b6">4.2. Key Mappings</a>
<ul>
<li><a href="#orgba30003">4.2.1. Tab Behavior</a></li>
<li><a href="#org94f8077">4.2.2. Navigation</a></li>
</ul>
</li>
<li><a href="#orgb0b72c6">4.3. Completion Sources</a></li>
<li><a href="#org66d5f83">4.4. Completion Options</a></li>
<li><a href="#org2b1eb0f">4.5. Snippets</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgc7603a3" class="outline-2">
<h2 id="orgc7603a3"><span class="section-number-2">1.</span> Overview</h2>
<div class="outline-text-2" id="text-1">
<p>
nvim-cmp is a completion engine plugin for Neovim, providing intelligent code completion with support for LSP, snippets, buffers, and file paths.
</p>
</div>
</div>

<div id="outline-container-orgd737b03" class="outline-2">
<h2 id="orgd737b03"><span class="section-number-2">2.</span> Setup</h2>
<div class="outline-text-2" id="text-2">
<div class="org-src-container">
<pre class="src src-lua">local cmp = require "cmp"
cmp.setup({
  snippet = {
    expand = function(args)
      require("luasnip").lsp_expand(args.body)
    end,
  },
  mapping = cmp.mapping.preset.insert({
    ["&lt;Tab&gt;"] = cmp.mapping(function(fallback)
      if cmp.visible() then
        cmp.confirm({ select = true }) -- Accept current / first suggestion
      elseif require("luasnip").expand_or_jumpable() then
        require("luasnip").expand_or_jump()
      else
        fallback() -- Normal tab behavior
      end
    end, { "i", "s" }),
    ["&lt;C-n&gt;"] = cmp.mapping(function(fallback)
      if cmp.visible() then
        cmp.select_next_item()
      else
        fallback()
      end
    end),
    ["&lt;C-p&gt;"] = cmp.mapping(function(fallback)
      if cmp.visible() then
        cmp.select_prev_item()
      else
        fallback()
      end
    end),
  }),
  sources = cmp.config.sources({
    { name = "nvim_lsp" },
    { name = "luasnip" },
    { name = "buffer" },
    { name = "path" },
  }),
  completion = {
    completeopt = "menu,menuone,noinsert"
  }
})
</pre>
</div>
</div>
</div>

<div id="outline-container-org0d3cc1d" class="outline-2">
<h2 id="org0d3cc1d"><span class="section-number-2">3.</span> Load Snippets</h2>
<div class="outline-text-2" id="text-3">
<div class="org-src-container">
<pre class="src src-lua">require "luasnip.loaders.from_vscode".lazy_load()
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf4f5bed" class="outline-2">
<h2 id="orgf4f5bed"><span class="section-number-2">4.</span> Configuration Explained</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgfb65247" class="outline-3">
<h3 id="orgfb65247"><span class="section-number-3">4.1.</span> Snippet Engine</h3>
<div class="outline-text-3" id="text-4-1">
<p>
LuaSnip is configured as the snippet expansion engine, handling snippet completions and expansions.
</p>
</div>
</div>

<div id="outline-container-orgd3f00b6" class="outline-3">
<h3 id="orgd3f00b6"><span class="section-number-3">4.2.</span> Key Mappings</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-orgba30003" class="outline-4">
<h4 id="orgba30003"><span class="section-number-4">4.2.1.</span> Tab Behavior</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
The Tab key has intelligent behavior:
</p>
<ol class="org-ol">
<li>If completion menu is visible → Accept the selected/first suggestion</li>
<li>If inside a snippet → Jump to next placeholder</li>
<li>Otherwise → Normal tab insertion</li>
</ol>
</div>
</div>

<div id="outline-container-org94f8077" class="outline-4">
<h4 id="org94f8077"><span class="section-number-4">4.2.2.</span> Navigation</h4>
<div class="outline-text-4" id="text-4-2-2">
<ul class="org-ul">
<li><code>&lt;C-n&gt;</code> - Next completion item (when menu is visible)</li>
<li><code>&lt;C-p&gt;</code> - Previous completion item (when menu is visible)</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb0b72c6" class="outline-3">
<h3 id="orgb0b72c6"><span class="section-number-3">4.3.</span> Completion Sources</h3>
<div class="outline-text-3" id="text-4-3">
<p>
The completion sources are prioritized in this order:
</p>
<ol class="org-ol">
<li><b><b>nvim<sub>lsp</sub></b></b> - Language Server Protocol completions</li>
<li><b><b>luasnip</b></b> - Snippet completions</li>
<li><b><b>buffer</b></b> - Words from current buffer</li>
<li><b><b>path</b></b> - File system paths</li>
</ol>
</div>
</div>

<div id="outline-container-org66d5f83" class="outline-3">
<h3 id="org66d5f83"><span class="section-number-3">4.4.</span> Completion Options</h3>
<div class="outline-text-3" id="text-4-4">
<ul class="org-ul">
<li><code>menu</code> - Show completion menu</li>
<li><code>menuone</code> - Show menu even with only one item</li>
<li><code>noinsert</code> - Don't insert text until explicitly selected</li>
</ul>
</div>
</div>

<div id="outline-container-org2b1eb0f" class="outline-3">
<h3 id="org2b1eb0f"><span class="section-number-3">4.5.</span> Snippets</h3>
<div class="outline-text-3" id="text-4-5">
<p>
Loads snippets from VSCode-style snippet collections via the friendly-snippets plugin.
</p>
</div>
</div>
</div>
</main>
<footer id="postamble" class="status">
<p class="date">Date: 2025-12-01</p>
</footer>
</body>
</html>
